salesforce-minor-mode.org
#+title:     SALESFORCE-MINOR-MODE
#+author:    tan.nguyen
#+email:     tan.nguyen@furucrm.com


* TABLE OF CONTENTS :toc_4:
- [[#minor-mode][MINOR MODE]]
  - [[#requirement][REQUIREMENT]]
  - [[#config-variable][CONFIG VARIABLE]]
  - [[#salesforce-functions][SALESFORCE FUNCTIONS]]
    - [[#functions-use-force-prefix][FUNCTIONS USE FORCE PREFIX]]
      - [[#push-source-salesforce-to-org][PUSH SOURCE SALESFORCE TO ORG]]
      - [[#retrieve-source-salesforce-from-org][RETRIEVE SOURCE SALESFORCE FROM ORG]]
    - [[#functions-use-org-prefix][FUNCTIONS USE ORG PREFIX]]
      - [[#open-org-within-ctable][OPEN ORG WITHIN CTABLE]]
      - [[#open-org-project][OPEN ORG PROJECT]]
      - [[#display-all-org][DISPLAY ALL ORG]]
      - [[#show-org-connect-status][SHOW ORG CONNECT STATUS]]
      - [[#get-default-org][GET DEFAULT ORG]]
      - [[#refresh-org][REFRESH ORG]]
    - [[#functions-use-apex-prefix][FUNCTIONS USE APEX PREFIX]]
      - [[#idea-apex-logs][IDEA APEX LOGS]]
      - [[#proj-apex-log][PROJ APEX LOG]]
      - [[#execute-apex-code][EXECUTE APEX CODE]]
    - [[#functions-use-login-prefix][FUNCTIONS USE LOGIN PREFIX]]
      - [[#scratchsanbox-org][SCRATCH/SANBOX ORG]]
      - [[#productiondev-org][PRODUCTION/DEV ORG]]
    - [[#functions-salesforce-query-records][FUNCTIONS SALESFORCE QUERY RECORDS]]
      - [[#soql-string][SOQL STRING]]
      - [[#soql-file][SOQL FILE]]
    - [[#compare-local-file-with-org-file][COMPARE LOCAL FILE WITH ORG FILE]]
    - [[#functioncs-generate-metadata][FUNCTIONCS GENERATE METADATA]]
      - [[#visualforce-page][VISUALFORCE PAGE]]
      - [[#visualforce-component][VISUALFORCE COMPONENT]]
      - [[#apex-class][APEX CLASS]]
      - [[#lightning-metadata][LIGHTNING METADATA]]
    - [[#function-apex-test-01][FUNCTION APEX TEST]]
      - [[#run-all-tests-class][RUN ALL TESTS CLASS]]
      - [[#run-local-test-classes][RUN LOCAL TEST CLASSES]]
      - [[#--run-specific-unit-test][[ ] RUN SPECIFIC UNIT TEST]]
    - [[#run-lwc-local-server][RUN LWC LOCAL SERVER]]
  - [[#internal-functions][INTERNAL FUNCTIONS]]
    - [[#get-errors][GET ERRORS]]
    - [[#generate-command][GENERATE COMMAND]]
    - [[#execute-apex-code-1][EXECUTE APEX CODE]]
    - [[#excute-soql-block][EXCUTE SOQL BLOCK]]
    - [[#make-synchronous-process][MAKE SYNCHRONOUS PROCESS]]
    - [[#make-asynchronous-process][MAKE ASYNCHRONOUS PROCESS]]
    - [[#execute-synchronous-salesforce-command][EXECUTE SYNCHRONOUS SALESFORCE COMMAND]]
    - [[#execute-asynchronous-salesforce-command][EXECUTE ASYNCHRONOUS SALESFORCE COMMAND]]
    - [[#convert-hashtable-to-list-data][CONVERT HASHTABLE TO LIST DATA]]
    - [[#custom-map-list-function][CUSTOM MAP LIST FUNCTION]]
    - [[#extract-data-in-hashtable][EXTRACT DATA IN HASHTABLE]]
  - [[#build-table-functions][BUILD TABLE FUNCTIONS]]
    - [[#build-ctable-component][BUILD CTABLE COMPONENT]]
    - [[#build-ctable-header-table][BUILD CTABLE HEADER TABLE]]
  - [[#helpers-functions][HELPERS FUNCTIONS]]
    - [[#key-binding-functions][KEY BINDING FUNCTIONS]]
    - [[#hook-functions][HOOK FUNCTIONS]]
  - [[#define-minor-mode][DEFINE MINOR MODE]]
- [[#org-babel-apex][ORG BABEL APEX]]
  - [[#dependencies][DEPENDENCIES]]
  - [[#extensions][Extensions]]
  - [[#default-header-args][DEFAULT HEADER ARGS]]
  - [[#expand-source-code][EXPAND SOURCE CODE]]
  - [[#evaluate-apex-code][EVALUATE APEX CODE]]
  - [[#execute-apex-block-code][EXECUTE APEX BLOCK CODE]]
- [[#log-mode][LOG MODE]]
- [[#org-babel-apex-log][ORG BABEL APEX LOG]]
  - [[#dependencies-1][DEPENDENCIES]]
  - [[#define-headers][DEFINE HEADERS]]
  - [[#expand-body-apex-log][EXPAND BODY APEX LOG]]
  - [[#execute-apex-log][EXECUTE APEX LOG]]
  - [[#run-test-class][RUN TEST CLASS]]
  - [[#filter-log-content][FILTER LOG CONTENT]]

* MINOR MODE
** REQUIREMENT
#+begin_src emacs-lisp :tangle yes
(require 'alert)
(require 'projectile)
(require 'ctable)
(require 'subr-x)
(require 'cl-lib)
#+end_src

** CONFIG VARIABLE
#+begin_src emacs-lisp :tangle yes
(defcustom sfmm:keymap-prefix "M-o"
  "The prefix for salesforce-mode key bindings."
  :type 'string
  :group 'salesforce)

(defcustom sfmm:org-keymap-prefix "O"
  "The keymap prefix for Org function"
  :type 'string
  :group 'salesforce)

(defcustom sfmm:auth-keymap-prefix "A"
  "The keymap prefix for Auth function"
  :type 'string
  :group 'salesforce)

(defcustom sfmm:apex-keymap-prefix "C"
  "The keymap prefix for Apex function"
  :type 'string
  :group 'salesforce)

(defcustom sfmm:query-keymap-prefix "Q"
  "The keymap prefix for Database function"
  :type 'string
  :group 'salesforce)

(defcustom sfmm:tangle-on-save t
  "When t, automatically tangle Org files on save."
  :type 'boolean
  :group 'salesforce)

(defcustom sfmm:api-version nil
  "Custom define api version for command"
   :type 'string
   :group 'salesforce-cli)

(defcustom sfmm:package-dir "manifest"
  "Custom define api version for command"
   :type 'string
   :group 'salesforce-cli)

(defcustom sfmm:non-scratch-org-header-display
  '("username" "instanceUrl" "orgId" "isDevHub" "instanceApiVersion" "alias" "lastUsed" "connectedStatus")
  "Custom define header display on table non scratch orgs"
  :type 'list
  :group 'salesforce-cli)

(defcustom sfmm:scratch-org-header-display
  '("username" "password" "instanceUrl" "orgId" "expirationDate" "instanceApiVersion" "alias" "connectedStatus")
  "Custom define header display on table scratch orgs"
  :type 'list
  :group 'salesforce-cli)

(defcustom sfmm:sfdx-lib-alias "sf"
  ""
  :type 'string
  :group 'command-alias)

(defcustom sfmm:sfdx-legacy-alias "force"
 ""
 :type 'string
 :group 'command-alias)

(defcustom sfmm:project-command-alias "project"
  ""
  :type 'string
  :group 'command-alias)

(defcustom sfmm:data-command-alias "data"
  ""
  :type 'string
  :group 'command-alias)

(defcustom sfmm:visualforce-command-alias "visualforce"
  ""
  :type 'string
  :group 'command-alias)

(defcustom sfmm:apex-command-alias "apex"
  ""
  :type 'string
  :group 'command-alias)

(defcustom sfmm:org-command-alias "org"
  ""
  :type 'string
  :group 'command-alias)

(defcustom sfmm:lightning-command-alias "lightning"
  ""
  :type 'string
  :group 'command-alias)

(defcustom sfmm:project-deploy-command
  (concat sfmm:project-command-alias " " "deploy")
  ""
  :type 'string
  :group 'project-command)

(defcustom sfmm:project-retrieve-command
  (concat sfmm:project-command-alias " " "retrieve")
  ""
  :type 'string
  :group 'project-command)

(defcustom sfmm:default-browser "qutebrowser"
  "Browser use for open url"
  :type 'string
  :group 'sfdx-cli)

(defcustom sfmm:default-apex-class-path "force-app/main/default/classes"
 "Path save apex classes"
 :type 'string
 :group 'sfdx-config)

(defcustom sfmm:default-lwc-path "force-app/main/default/lwc"
 "Path save lwc components"
 :type 'string
 :group 'sfdx-config)

(defcustom sfmm:default-aura-path "force-app/main/default/aura"
 "Path save aura components"
 :type 'string
 :group 'sfdx-config)

(defcustom sfmm:default-test-path "force-app/main/default/lightningTests"
 "Path save test components"
 :type 'string
 :group 'sfdx-config)
#+end_src

** SALESFORCE FUNCTIONS
#+begin_src emacs-lisp :tangle yes
(add-to-list
 'display-buffer-alist
  '("salesforce api.*" . (display-buffer-no-window . nil)))

#+end_src

*** FUNCTIONS USE FORCE PREFIX
**** PUSH SOURCE SALESFORCE TO ORG
#+begin_src emacs-lisp :tangle yes
(defun sfmm:push-file
    ()
  "Push source salesforce to org"
  (interactive)
  (let* ((push-command (list sfmm:sfdx-lib-alias "force" "source" "deploy" "-p" buffer-file-name "--json")))

    (sfmm--helper:make-async-process
     :command push-command
     :handle-success-lambda
     `(lambda (process json-instance buffer)
       (alert (format "Deploy %s success" ,buffer-file-name)
              :title "Salesforce Alert"))

     :handle-error-lambda
     `(lambda (process json-instance buffer)
       (alert (format "Deploy %s failures:\n %s"
                     ,buffer-file-name
                     (sfmm--helper:get-errors-json json-instance)
               :title "Salesforce Alert"))))))
#+end_src
**** RETRIEVE SOURCE SALESFORCE FROM ORG
#+begin_src emacs-lisp :tangle yes
(defun sfmm:retrieve-file
    ()
  "Retrieve source salesforce form org"
  (interactive)
  (let ((retrieve-command (list sfmm:sfdx-lib-alias "force" "source" "retrieve" "-p" buffer-file-name "--json")))

    (sfmm--helper:make-async-process
     :command retrieve-command
     :handle-success-lambda
     `(lambda (process json-instance buffer)
        (alert (format "Retrieve %s success" ,buffer-file-name)
               :title "Salesforce Alert")))))
#+end_src
*** FUNCTIONS USE ORG PREFIX
**** OPEN ORG WITHIN CTABLE
#+begin_src emacs-lisp :tangle yes
(defun sfmm:org:specific-open ()
   "Use a specific user name to open org"
   (interactive)
   (let ((user-name (ctbl:cp-get-selected-data-cell (ctbl:cp-get-component))))

     (unless user-name
       (setq user-name (read-string "user-name: ")))

     (sfmm--helper:make-sync-process
      :command
      (sfmm--helper:generate-command (list "org" "open" "--json" "-o" user-name "-r"))
      :handle-success-lambda
      (lambda (process json-instance buffer)
        (let ((url (sfmm--helper:get-data-hashtable "result.url" json-instance)))

          (shell-command (format "%s --target %s %S"
                                 sfmm:default-browser
                                 "tab"
                                 url)))))))
#+end_src

**** OPEN ORG PROJECT
#+begin_src emacs-lisp :tangle yes
(defun sfmm:org:default-open ()
   "Open default org"
   (interactive)
   (let ((command (sfmm--helper:generate-command (list "org" "open" "--json" "-r"))))

     (sfmm--helper:make-async-process
      :command command
      :handle-success-lambda
      (lambda (process json-instance buffer)
        (let ((url (sfmm--helper:get-data-hashtable "result.url" json-instance)))

          (shell-command (concat sfmm:default-browser " " (format "%S" url) " " "&")))))))
#+end_src

**** DISPLAY ALL ORG
#+begin_src emacs-lisp :tangle yes
(defun sfmm:display-all-org (org-type)
  "Display all current connect org"
  (let ((command (sfmm--helper:generate-command (list sfmm:org-command-alias "list" "--json"))))

    (sfmm--helper:make-sync-process
     :command command
     :handle-success-lambda
     (lambda (process json-instance buffer)
       (let ((start-index 1)
             (column-header-map #s(hash-table test equal data ("No" ((:align . 'left) (:title . "No"))))))
         (mapcar
          (lambda (item)
            (puthash
             (format "%s" item)
             `((:align . ,'left) (:title . ,item))
             column-header-map))
          (cond ((string= org-type "nonScratchOrgs") sfmm:non-scratch-org-header-display)
                ((string= org-type "scratchOrgs")) sfmm:scratch-org-header-display))

         (if (= (gethash "status" json-instance) 0)
             (let* ((non-scratch-orgs
                     (sfmm--helper:get-data-hashtable
                      (concat "result." org-type) json-instance))
                    (data
                     (mapcar
                      (lambda (element)
                        (let ((row
                               (sfmm--helper:convert-hashtable-data-to-list
                                :hashtable-data element
                                :columns
                                (cond ((string= org-type "nonScratchOrgs") sfmm:non-scratch-org-header-display)
                                      ((string= org-type "scratchOrgs")) sfmm:scratch-org-header-display)
                                :post-process
                                (lambda (key value)
                                  (let ((column-config
                                         `((:align . ,'left) (:title . ,key))))

                                    (when (length> value 50)
                                        (add-to-list 'column-config `(:max-width . ,'50))

                                        (puthash (format "%s" key) column-config column-header-map)))))))

                          (progn
                            (add-to-list 'row start-index
                                         nil (lambda (el1 el2) nil))
                            (setq start-index
                                  (1+ start-index))
                            row)))
                      non-scratch-orgs)))

               (sfdx--build:make-table-component
                :column-header (hash-table-values column-header-map)
                :data data
                :buffer buffer))))))))
#+end_src
***** NON SCRATCH ORG
#+begin_src emacs-lisp :tangle yes
(defun sfmm:display-all-non-scratch-orgs ()
  (interactive)
  (sfmm:display-all-org "nonScratchOrgs"))
#+end_src
***** SCRATCH ORG
#+begin_src emacs-lisp :tangle yes
(defun sfmm:display-all-scratch-orgs ()
  (interactive)
  (sfmm:display-all-org "scratchOrgs"))
#+end_src
**** SHOW ORG CONNECT STATUS
#+begin_src emacs-lisp :tangle yes
(defun sf:org:connect-status ()
  "Check connect status to org"
  (let ((display-org-information-command (sfmm--helper:generate-command (list sfmm:org-command-alias "display" "--json"))))

    (sfmm--helper:make-async-process
     :command display-org-information-command
     :handle-success-lambda
     (lambda (process json-instance buffer)
        (let* ((status (sfmm--helper:get-data-hashtable "result.connectedStatus" json-instance)))
          (when (string= status
                         "RefreshTokenAuthError")
            (alert "Token expired !!" :title "Salesforce Alert")))))))
#+end_src
**** TODO GET DEFAULT ORG
#+begin_src emacs-lisp :tangle yes
(defun sfmm:org:show-current-org ()
  (let ((org-alias ""))

    (sfmm--helper:make-async-process
     :command (sfmm--helper:generate-command (list sfmm:org-command-alias "display" "--json"))
     :handle-success-lambda
     `(lambda (process json-instance buffer)
        (setq ,'org-alias (sfmm--helper:get-data-hashtable "result.alias" json-instance))))
    org-alias))
#+end_src
**** REFRESH ORG
#+begin_src emacs-lisp :tangle yes
(defun sfmm:refresh-default-org
    ()
  "Refresh current default org on layout"
  (interactive)
  (sfmm:org:show-current-org))
#+end_src
*** FUNCTIONS USE APEX PREFIX
