salesforce-minor-mode.org
** EXECUTE APEX BLOCK CODE
#+begin_src emacs-lisp :tangle ./ob-apex.el
(defun execute-apex-code (processed-params content)
  (let* ((uuid (org-id-uuid))
         (buffer (buffer-file-name))
         (tempfile (make-temp-file "temp-code"))
         (result-eval (format "%s" (cdr (assq :results processed-params))))
         (command
           (sfmm--helper:generate-command (list "apex" "run" "-f" tempfile "--json")))
         process 'nil)

   (write-region content nil tempfile)

   (cond ((not (eq (cdr (assq :org processed-params))
                   ""))
          (setq command (append command
                                (list "-o" (cdr (assq :org processed-params)))))))

   ;; Clear default result
   (org-babel-remove-result)

   (unless (string= result-eval "none")
     (re-search-forward "#\\+end_src")
     ;; Insert new result with uuid
     (insert (format "\n\n#+begin_src apex-log :uuid %s\n %s\n#+end_src\n"
                     uuid
                     uuid)))

   
   (sfmm--helper:make-async-process
    :command command
    :handle-success-lambda
    `(lambda (process json-instance buffer)

       (let ((log-content (sfmm--helper:get-data-hashtable "result.logs" json-instance))
             (log-filter-type ,(format "%s" (cdr (assq :log-filter-type processed-params))))
             (log-filter-value ,(format "%s" (cdr (assq :log-filter-value processed-params)))))

         (unless (or (equal log-filter-type "none")
                     (null log-filter-type))
           (let ((debug-keywords '("DEBUG"))
                 (executable-keywords '("VARIABLE_ASSIGNMENT"
                                        "STATEMENT_EXECUTE"
                                        "METHOD_ENTRY"
                                        "CONSTRUCTOR_EXIT"
                                        "CODE_UNIT_STARTED"))
                 (system-keywords '("VARIABLE_SCOPE_BEGIN"
                                    "USER_INFO"
                                    "EXECUTION_STARTED"
                                    "CODE_UNIT_STARTED"
                                    "HEAP_ALLOCATE"
                                    "STATEMENT_EXECUTE"
                                    "METHOD_ENTRY"))
                 (groverment-keywords '("LIMIT_USAGE_FOR_NS"
                                        "Number of"
                                        "Maximum CPU"
                                        "Maximum heap")))

              (setq log-content
                    (mapconcat (lambda (line)
                                 (cond ((and (equal log-filter-type "DEBUG")
                                             (string-match (regexp-opt debug-keywords) line))

                                        (concat line "\n"))
                                       ((and (equal log-filter-type "FILTER")
                                             (search log-filter-value line))
                                        (concat line "\n"))
                                       ((and (equal log-filter-type "EXECUTABLE")
                                             (string-match (regexp-opt executable-keywords) line))
                                        (concat line "\n"))
                                       ((and (equal log-filter-type "SYSTEM")
                                             (string-match (regexp-opt system-keywords) line))

                                        (concat line "\n"))
                                       ((and (eq log-filter-type "GOVERNMENT")
                                             (match-string (regexp-opt groverment-keywords) line))
                                        (concat line "\n"))))
                              (split-string log-content "\n")
                              ""))))

         (unless (equal ,result-eval "none")

           (with-current-buffer (find-file-noselect ,buffer)
             (beginning-of-buffer)
             (re-search-forward ,uuid)
             (delete-line)

             (insert log-content)))

         (alert "Run apex code complete"
                :title "Salesforce Alert"))))))

(defun binding-declare-variable (pair)
  (let* ((var
          (split-string
            (format "%s"(car pair)) "\\."))
         (var-type (car var))
         (var-name (car (cdr var)))
         (value
          (org-babel-template-var-to-template
           (cdr pair))))

    (format
     "%s %s = %s;"
     var-type
     var-name
     (if (string= var-type "String")
       (format "'%s'" value)
       value))))

(defun org-babel-prep-session:apex (session params)
  "Prepare SESSION according to the header arguments specified in PARAMS.")


(defun org-babel-template-var-to-template (var)
  "Convert an elisp var into a string of template source code
specifying a var of the same value."
  (format "%s" var))

(defun org-babel-template-table-or-string (results)
  "If the results look like a table, then convert them into an
Emacs-lisp table, otherwise return the results as a string.")


(defun org-babel-template-initiate-session (&optional session)
  "If there is not a current inferior-process-buffer in SESSION then create.
Return the initialized session."
  (unless (string= session "none")))

(provide 'ob-apex)
#+end_src
